/**
 *****************************************************************************        
 * \brief       板级支持包层(BSP)BSP模块(BSP)相关数据结构和接口描述.
 * \details     Copyright (c) 2017,长沙威胜信息技术有限公司.
 *              All rights reserved.    
 * \file        bsp.h  
 * \author      李红洁W18900
 * \version     1.0 
 * \date        2017-10-21
 * \note        使用前请参考注释.\n
 *              本头文件作为BSP层总的头文件.
 * \since       李红洁      2017-10-21 14:26:49     1.0     新建 
 * \par 修订记录
 * - 2017-10-21 初始版本
 * \par 资源说明
 * - RAM:              
 * - ROM:
 *****************************************************************************
 */

#ifndef __BSP_H
#define __BSP_H

#ifdef __cplusplus
 extern "C" {
#endif

     
/** \addtogroup BSP BSP
 *  \{
 */    
     
/** \addtogroup BSP_BSP BSP_BSP
 *  \{
 */
   
#include "bsp_sci.h"
#include "bsp_time.h"
/*****************************************************************************    
 *                                                                           *
 *                             数据结构描述                                  *
 *                                                                          *
 ****************************************************************************/
   
/** \defgroup BSP_data BSP_data
  * \{
  */
   
/**
  * \}
  */
/*****************************************************************************    
 *                                                                           
 *                             接口函数描述                                   
 *                                                                            
 ****************************************************************************/

/** \defgroup BSP_if BSP_if
  * \{
  */


/**
 *****************************************************************************
 * \fn          int BSP_Init(void)
 * \brief       初始化BSP层.
 * \note        系统调用该函数完成最底层的初始化.
 * \retval      0  初始化成功.
 * \retval      -1 初始化失败.
 *****************************************************************************
 */
int BSP_Init(void);


/**
 *****************************************************************************
 * \fn          int BSP_GetVersion(void)
 * \brief       获取BSP版本.
 * \note        .  
 * \return      int 返回版本信息 \ref HAL_VERSION 
 *****************************************************************************
 */
int BSP_GetVersion(void);

/**
 *****************************************************************************
 * \fn          int BSP_DeInit(void)
 * \brief       解除BSP层初始化.
 * \note        .
 * \retval      0  成功.
 * \retval      -1 失败.
 *****************************************************************************
 */
int BSP_DeInit(void);

/**
  * \}
  */

/*****************************************************************************    
 *                                                                           
 *                             参数配置描述                                   
 *                                                                            
 ****************************************************************************/
/** \defgroup BSP_cfg BSP_cfg
  * \{
  */

/*! \file bsp_cfg.md
 *  参数配置描述
 */

/**
  * \}
  */

/**
  * \}
  */

/**
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif
