/**
 *****************************************************************************        
 * \brief       驱动层(DRIVER)DRIVER模块(DRIVER)相关数据结构和接口描述.
 * \details     Copyright (c) 2017,长沙威胜信息技术有限公司.
 *              All rights reserved.    
 * \file        driver.h  
 * \author      李红洁W18900
 * \version     1.0 
 * \date        2017-10-20
 * \note        使用前请参考注释.\n
 *              依赖于HAL和OS实现.\n
 *              本头文件作为DRIVER层总的头文件.
 * \since       李红洁      2017-10-20 16:30:29     1.0     新建 
 * \par 修订记录
 * - 2017-10-20 初始版本
 * \par 资源说明
 * - RAM:              
 * - ROM:
 *****************************************************************************
 */

#ifndef __DRIVER_H
#define __DRIVER_H

#ifdef __cplusplus
 extern "C" {
#endif

     
/** \addtogroup DRIVER 驱动层(DRIVER)
 *  \{
 */    
     
/** \addtogroup DRIVER_DRIVER 驱动层(DRIVER)DRIVER模块(DRIVER)
 *  \{
 */
#include <time.h>
#include "hal.h"
#include "driver_uart.h"
#include "driver_can.h"
#include "driver_time.h"
   
/*****************************************************************************    
 *                                                                           *
 *                             数据结构描述                                  *
 *                                                                          *
 ****************************************************************************/
   

/** \defgroup DRIVER_DRIVER_data 驱动层(DRIVER)DRIVER模块(DRIVER)数据结构
  * \{
  */
   
/**
  * \}
  */
/*****************************************************************************    
 *                                                                           
 *                             接口函数描述                                   
 *                                                                            
 ****************************************************************************/

/** \defgroup DRIVER_DRIVER_if 驱动层(DRIVER)DRIVER模块(DRIVER)接口
  * \{
  */


/**
 *****************************************************************************
 * \fn          int driver_init(void)
 * \brief       初始化DRIVER层.
 * \note        系统调用该函数完成最驱动的初始化.
 * \retval      0  初始化成功.
 * \retval      -1 初始化失败.
 *****************************************************************************
 */
int driver_init(void);


/**
  * \}
  */

/** \defgroup DRIVER_samp 驱动层(DRIVER)DRIVER模块(DRIVER)使用样例
  * \{
  */

/*****************************************************************************    
 *                                                                           
 *                             使用样例                                   
 *                                                                            
 ****************************************************************************/

/**
 *****************************************************************************
 * \fn          void driver_samp(void)
 * \brief       使用样例.
 * \par   参见  【示例】标签下的【hal_driver.c】
 *****************************************************************************
 */
void hal_driver_samp(void);

/**
 *\example driver_samp.c
 * 驱动层(DRIVER)DRIVER模块(DRIVER)使用样例.\n
 */

/**
  * \}
  */

/**
  * \}
  */

/**
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif
